<template>
  <div class="appVideoDescription">
    Статья 2. Отношения, регулируемые законодательством о налогах и сборах
    Статья 2. Отношения, регулируемые законодательством о налогах и сборах 1.
    Законодательство о налогах и сборах регулирует властные отношения по
    установлению, введению и взиманию налогов, сборов, страховых взносов в
    Российской Федерации, а также отношения, возникающие в процессе
    осуществления налогового контроля, обжалования актов налоговых органов,
    действий (бездействия) их должностных лиц и привлечения к ответственности за
    совершение налогового правонарушения. 2. К отношениям по установлению,
    введению и взиманию таможенных платежей, а также к отношениям, возникающим в
    процессе осуществления контроля за уплатой таможенных платежей, обжалования
    актов таможенных органов, действий (бездействия) их должностных лиц и
    привлечения к ответственности виновных лиц, законодательство о налогах и
    сборах не применяется, если иное не предусмотрено настоящим Кодексом. 3. К
    отношениям по установлению и взиманию страховых взносов на обязательное
    социальное страхование от несчастных случаев на производстве и
    профессиональных заболеваний и страховых взносов на обязательное медицинское
    страхование неработающего населения, а также к отношениям, возникающим в
    процессе осуществления контроля за уплатой указанных страховых взносов,
    обжалования актов, действий (бездействия) должностных лиц соответствующих
    органов контроля и привлечения к ответственности виновных лиц,
    законодательство о налогах и сборах не применяется.
  </div>
</template>

<script setup lang="ts"></script>

<style scoped lang="scss">
.appVideoDescription {
  grid-area: topic_description;
  background-color: $white;
  border-radius: 0.625rem;
  padding: 0.625rem;
  overflow-y: auto;
  box-shadow: $box-shadow-2dp;
  margin-right: 1.5rem;
}
</style>
